zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/fmc_reg.h
#define FMC_APWPROT0_APPROEN24_Pos       (24)                                              /*!< FMC_T::APWPROT0: APPROEN24 Position      */
#define FMC_APWPROT0_APPROEN24_Msk       (0x1ul << FMC_APWPROT0_APPROEN24_Pos)             /*!< FMC_T::APWPROT0: APPROEN24 Mask          */

#define FMC_APWPROT0_APPROEN25_Pos       (25)                                              /*!< FMC_T::APWPROT0: APPROEN25 Position      */
#define FMC_APWPROT0_APPROEN25_Msk       (0x1ul << FMC_APWPROT0_APPROEN25_Pos)             /*!< FMC_T::APWPROT0: APPROEN25 Mask          */

#define FMC_APWPROT0_APPROEN26_Pos       (26)                                              /*!< FMC_T::APWPROT0: APPROEN26 Position      */
#define FMC_APWPROT0_APPROEN26_Msk       (0x1ul << FMC_APWPROT0_APPROEN26_Pos)             /*!< FMC_T::APWPROT0: APPROEN26 Mask          */

#define FMC_APWPROT0_APPROEN27_Pos       (27)                                              /*!< FMC_T::APWPROT0: APPROEN27 Position      */
#define FMC_APWPROT0_APPROEN27_Msk       (0x1ul << FMC_APWPROT0_APPROEN27_Pos)             /*!< FMC_T::APWPROT0: APPROEN27 Mask          */

#define FMC_APWPROT0_APPROEN28_Pos       (28)                                              /*!< FMC_T::APWPROT0: APPROEN28 Position      */
#define FMC_APWPROT0_APPROEN28_Msk       (0x1ul << FMC_APWPROT0_APPROEN28_Pos)             /*!< FMC_T::APWPROT0: APPROEN28 Mask          */

#define FMC_APWPROT0_APPROEN29_Pos       (29)                                              /*!< FMC_T::APWPROT0: APPROEN29 Position      */
#define FMC_APWPROT0_APPROEN29_Msk       (0x1ul << FMC_APWPROT0_APPROEN29_Pos)             /*!< FMC_T::APWPROT0: APPROEN29 Mask          */

#define FMC_APWPROT0_APPROEN30_Pos       (30)                                              /*!< FMC_T::APWPROT0: APPROEN30 Position      */
#define FMC_APWPROT0_APPROEN30_Msk       (0x1ul << FMC_APWPROT0_APPROEN30_Pos)             /*!< FMC_T::APWPROT0: APPROEN30 Mask          */

#define FMC_APWPROT0_APPROEN31_Pos       (31)                                              /*!< FMC_T::APWPROT0: APPROEN31 Position      */
#define FMC_APWPROT0_APPROEN31_Msk       (0x1ul << FMC_APWPROT0_APPROEN31_Pos)             /*!< FMC_T::APWPROT0: APPROEN31 Mask          */

#define FMC_APWPROT1_APPROEN32_Pos       (32)                                              /*!< FMC_T::APWPROT1: APPROEN32 Position      */
#define FMC_APWPROT1_APPROEN32_Msk       (0x1ul << FMC_APWPROT1_APPROEN32_Pos)             /*!< FMC_T::APWPROT1: APPROEN32 Mask          */

#define FMC_APWPROT1_APPROEN33_Pos       (33)                                              /*!< FMC_T::APWPROT1: APPROEN33 Position      */
#define FMC_APWPROT1_APPROEN33_Msk       (0x1ul << FMC_APWPROT1_APPROEN33_Pos)             /*!< FMC_T::APWPROT1: APPROEN33 Mask          */

#define FMC_APWPROT1_APPROEN34_Pos       (34)                                              /*!< FMC_T::APWPROT1: APPROEN34 Position      */
#define FMC_APWPROT1_APPROEN34_Msk       (0x1ul << FMC_APWPROT1_APPROEN34_Pos)             /*!< FMC_T::APWPROT1: APPROEN34 Mask          */

#define FMC_APWPROT1_APPROEN35_Pos       (35)                                              /*!< FMC_T::APWPROT1: APPROEN35 Position      */
#define FMC_APWPROT1_APPROEN35_Msk       (0x1ul << FMC_APWPROT1_APPROEN35_Pos)             /*!< FMC_T::APWPROT1: APPROEN35 Mask          */

#define FMC_APWPROT1_APPROEN36_Pos       (36)                                              /*!< FMC_T::APWPROT1: APPROEN36 Position      */
#define FMC_APWPROT1_APPROEN36_Msk       (0x1ul << FMC_APWPROT1_APPROEN36_Pos)             /*!< FMC_T::APWPROT1: APPROEN36 Mask          */

#define FMC_APWPROT1_APPROEN37_Pos       (37)                                              /*!< FMC_T::APWPROT1: APPROEN37 Position      */
#define FMC_APWPROT1_APPROEN37_Msk       (0x1ul << FMC_APWPROT1_APPROEN37_Pos)             /*!< FMC_T::APWPROT1: APPROEN37 Mask          */

#define FMC_APWPROT1_APPROEN38_Pos       (38)                                              /*!< FMC_T::APWPROT1: APPROEN38 Position      */
#define FMC_APWPROT1_APPROEN38_Msk       (0x1ul << FMC_APWPROT1_APPROEN38_Pos)             /*!< FMC_T::APWPROT1: APPROEN38 Mask          */

#define FMC_APWPROT1_APPROEN39_Pos       (39)                                              /*!< FMC_T::APWPROT1: APPROEN39 Position      */
#define FMC_APWPROT1_APPROEN39_Msk       (0x1ul << FMC_APWPROT1_APPROEN39_Pos)             /*!< FMC_T::APWPROT1: APPROEN39 Mask          */

#define FMC_APWPROT1_APPROEN40_Pos       (40)                                              /*!< FMC_T::APWPROT1: APPROEN40 Position      */
#define FMC_APWPROT1_APPROEN40_Msk       (0x1ul << FMC_APWPROT1_APPROEN40_Pos)             /*!< FMC_T::APWPROT1: APPROEN40 Mask          */

#define FMC_APWPROT1_APPROEN41_Pos       (41)                                              /*!< FMC_T::APWPROT1: APPROEN41 Position      */
#define FMC_APWPROT1_APPROEN41_Msk       (0x1ul << FMC_APWPROT1_APPROEN41_Pos)             /*!< FMC_T::APWPROT1: APPROEN41 Mask          */

#define FMC_APWPROT1_APPROEN42_Pos       (42)                                              /*!< FMC_T::APWPROT1: APPROEN42 Position      */
#define FMC_APWPROT1_APPROEN42_Msk       (0x1ul << FMC_APWPROT1_APPROEN42_Pos)             /*!< FMC_T::APWPROT1: APPROEN42 Mask          */

#define FMC_APWPROT1_APPROEN43_Pos       (43)                                              /*!< FMC_T::APWPROT1: APPROEN43 Position      */
#define FMC_APWPROT1_APPROEN43_Msk       (0x1ul << FMC_APWPROT1_APPROEN43_Pos)             /*!< FMC_T::APWPROT1: APPROEN43 Mask          */

#define FMC_APWPROT1_APPROEN44_Pos       (44)                                              /*!< FMC_T::APWPROT1: APPROEN44 Position      */
#define FMC_APWPROT1_APPROEN44_Msk       (0x1ul << FMC_APWPROT1_APPROEN44_Pos)             /*!< FMC_T::APWPROT1: APPROEN44 Mask          */

#define FMC_APWPROT1_APPROEN45_Pos       (45)                                              /*!< FMC_T::APWPROT1: APPROEN45 Position      */
#define FMC_APWPROT1_APPROEN45_Msk       (0x1ul << FMC_APWPROT1_APPROEN45_Pos)             /*!< FMC_T::APWPROT1: APPROEN45 Mask          */

