zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/fmc_reg.h
#define FMC_APWPROT1_APPROEN46_Pos       (46)                                              /*!< FMC_T::APWPROT1: APPROEN46 Position      */
#define FMC_APWPROT1_APPROEN46_Msk       (0x1ul << FMC_APWPROT1_APPROEN46_Pos)             /*!< FMC_T::APWPROT1: APPROEN46 Mask          */

#define FMC_APWPROT1_APPROEN47_Pos       (47)                                              /*!< FMC_T::APWPROT1: APPROEN47 Position      */
#define FMC_APWPROT1_APPROEN47_Msk       (0x1ul << FMC_APWPROT1_APPROEN47_Pos)             /*!< FMC_T::APWPROT1: APPROEN47 Mask          */

#define FMC_APWPROT1_APPROEN48_Pos       (48)                                              /*!< FMC_T::APWPROT1: APPROEN48 Position      */
#define FMC_APWPROT1_APPROEN48_Msk       (0x1ul << FMC_APWPROT1_APPROEN48_Pos)             /*!< FMC_T::APWPROT1: APPROEN48 Mask          */

#define FMC_APWPROT1_APPROEN49_Pos       (49)                                              /*!< FMC_T::APWPROT1: APPROEN49 Position      */
#define FMC_APWPROT1_APPROEN49_Msk       (0x1ul << FMC_APWPROT1_APPROEN49_Pos)             /*!< FMC_T::APWPROT1: APPROEN49 Mask          */

#define FMC_APWPROT1_APPROEN50_Pos       (50)                                              /*!< FMC_T::APWPROT1: APPROEN50 Position      */
#define FMC_APWPROT1_APPROEN50_Msk       (0x1ul << FMC_APWPROT1_APPROEN50_Pos)             /*!< FMC_T::APWPROT1: APPROEN50 Mask          */

#define FMC_APWPROT1_APPROEN51_Pos       (51)                                              /*!< FMC_T::APWPROT1: APPROEN51 Position      */
#define FMC_APWPROT1_APPROEN51_Msk       (0x1ul << FMC_APWPROT1_APPROEN51_Pos)             /*!< FMC_T::APWPROT1: APPROEN51 Mask          */

#define FMC_APWPROT1_APPROEN52_Pos       (52)                                              /*!< FMC_T::APWPROT1: APPROEN52 Position      */
#define FMC_APWPROT1_APPROEN52_Msk       (0x1ul << FMC_APWPROT1_APPROEN52_Pos)             /*!< FMC_T::APWPROT1: APPROEN52 Mask          */

#define FMC_APWPROT1_APPROEN53_Pos       (53)                                              /*!< FMC_T::APWPROT1: APPROEN53 Position      */
#define FMC_APWPROT1_APPROEN53_Msk       (0x1ul << FMC_APWPROT1_APPROEN53_Pos)             /*!< FMC_T::APWPROT1: APPROEN53 Mask          */

#define FMC_APWPROT1_APPROEN54_Pos       (54)                                              /*!< FMC_T::APWPROT1: APPROEN54 Position      */
#define FMC_APWPROT1_APPROEN54_Msk       (0x1ul << FMC_APWPROT1_APPROEN54_Pos)             /*!< FMC_T::APWPROT1: APPROEN54 Mask          */

#define FMC_APWPROT1_APPROEN55_Pos       (55)                                              /*!< FMC_T::APWPROT1: APPROEN55 Position      */
#define FMC_APWPROT1_APPROEN55_Msk       (0x1ul << FMC_APWPROT1_APPROEN55_Pos)             /*!< FMC_T::APWPROT1: APPROEN55 Mask          */

#define FMC_APWPROT1_APPROEN56_Pos       (56)                                              /*!< FMC_T::APWPROT1: APPROEN56 Position      */
#define FMC_APWPROT1_APPROEN56_Msk       (0x1ul << FMC_APWPROT1_APPROEN56_Pos)             /*!< FMC_T::APWPROT1: APPROEN56 Mask          */

#define FMC_APWPROT1_APPROEN57_Pos       (57)                                              /*!< FMC_T::APWPROT1: APPROEN57 Position      */
#define FMC_APWPROT1_APPROEN57_Msk       (0x1ul << FMC_APWPROT1_APPROEN57_Pos)             /*!< FMC_T::APWPROT1: APPROEN57 Mask          */

#define FMC_APWPROT1_APPROEN58_Pos       (58)                                              /*!< FMC_T::APWPROT1: APPROEN58 Position      */
#define FMC_APWPROT1_APPROEN58_Msk       (0x1ul << FMC_APWPROT1_APPROEN58_Pos)             /*!< FMC_T::APWPROT1: APPROEN58 Mask          */

#define FMC_APWPROT1_APPROEN59_Pos       (59)                                              /*!< FMC_T::APWPROT1: APPROEN59 Position      */
#define FMC_APWPROT1_APPROEN59_Msk       (0x1ul << FMC_APWPROT1_APPROEN59_Pos)             /*!< FMC_T::APWPROT1: APPROEN59 Mask          */

#define FMC_APWPROT1_APPROEN60_Pos       (60)                                              /*!< FMC_T::APWPROT1: APPROEN60 Position      */
#define FMC_APWPROT1_APPROEN60_Msk       (0x1ul << FMC_APWPROT1_APPROEN60_Pos)             /*!< FMC_T::APWPROT1: APPROEN60 Mask          */

#define FMC_APWPROT1_APPROEN61_Pos       (61)                                              /*!< FMC_T::APWPROT1: APPROEN61 Position      */
#define FMC_APWPROT1_APPROEN61_Msk       (0x1ul << FMC_APWPROT1_APPROEN61_Pos)             /*!< FMC_T::APWPROT1: APPROEN61 Mask          */

#define FMC_APWPROT1_APPROEN62_Pos       (62)                                              /*!< FMC_T::APWPROT1: APPROEN62 Position      */
#define FMC_APWPROT1_APPROEN62_Msk       (0x1ul << FMC_APWPROT1_APPROEN62_Pos)             /*!< FMC_T::APWPROT1: APPROEN62 Mask          */

#define FMC_APWPROT1_APPROEN63_Pos       (63)                                              /*!< FMC_T::APWPROT1: APPROEN63 Position      */
#define FMC_APWPROT1_APPROEN63_Msk       (0x1ul << FMC_APWPROT1_APPROEN63_Pos)             /*!< FMC_T::APWPROT1: APPROEN63 Mask          */

#define FMC_APWPKEEP_APWPKEEP0_Pos      (0)                                                /*!< FMC_T::FMC_APWPKEEP: APWPKEEP0 Position  */
#define FMC_APWPKEEP_APWPKEEP0_Msk      (0xfffful << FMC_APWPKEEP_APWPKEEP0_Pos)           /*!< FMC_T::FMC_APWPKEEP: APWPKEEP0 Mask      */

#define FMC_APWPKEEP_APWPKEEP1_Pos      (16)                                               /*!< FMC_T::FMC_APWPKEEP: APWPKEEP1 Position  */
#define FMC_APWPKEEP_APWPKEEP1_Msk      (0xfffful << FMC_APWPKEEP_APWPKEEP1_Pos)           /*!< FMC_T::FMC_APWPKEEP: APWPKEEP1 Mask      */

#define FMC_SCACT_SCACT_Pos             (0)                                                /*!< FMC_T::FMC_SCACT: SCACT Position         */
#define FMC_SCACT_SCACT_Msk             (0x1ul << FMC_SCACT_SCACT_Pos)                     /*!< FMC_T::FMC_SCACT: SCACT Mask             */

/** @} FMC_CONST */
/** @} end of FMC register group */
/** @} end of REGISTER group */

#if defined ( __CC_ARM   )
    #pragma no_anon_unions
#endif

#endif /* __FMC_REG_H__ */
